# Imputación

Surge a partir del problema de tener valores faltantes en un dataset, en donde la mayoría de modelos tienen inconvenientes al analizar estos

## Técnicas

In [2]:
import pandas as pd
import numpy as np

### Pandas

In [3]:
df = pd.read_csv("../../data/raw/clientes.csv")
df.head()

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
2     NaN  70.0  20000.0
3  Carmen  49.0  22000.0
4     NaN   NaN      NaN

In [5]:
df.isnull().sum()

nombre     2
edad       3
ingreso    3
dtype: int64

#### Eliminar datos

In [8]:
df.dropna()

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0

In [10]:
df.dropna(subset=["nombre", "ingreso"])

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0
6   Pedro   NaN  17400.0

#### Llenarlos

In [11]:
df.fillna(0)

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2        0  70.0  20000.0
3   Carmen  49.0  22000.0
4        0   0.0      0.0
5    Mario  30.0  15800.0
6    Pedro   0.0  17400.0
7  Gustavo  27.0      0.0
8   Carlos   0.0      0.0

In [18]:
df.fillna({
    "nombre": "DESCONOCIDO",
    "edad": df["edad"].mean(),
    "ingreso": df["ingreso"].mean(),
})

        nombre       edad  ingreso
0         Juan  35.000000  15800.0
1        Luisa  25.000000  17000.0
2  DESCONOCIDO  70.000000  20000.0
3       Carmen  49.000000  22000.0
4  DESCONOCIDO  39.333333  18000.0
5        Mario  30.000000  15800.0
6        Pedro  39.333333  17400.0
7      Gustavo  27.000000  18000.0
8       Carlos  39.333333  18000.0

### KNN